
"EncryptionKey.Description" = "This image is a visualization of the encryption key for this secret chat with %1$@.\n\nIf this image looks the same on %2$@'s device, your chat is 200%% secure.\n\nLearn more at telegram.org";
"EncryptionKey.EncryptionKey" = "Encryption Key";


"Typing.Typing" = "typing";
"Typing.AreTyping" = "%@ are typing";
"Typing.IsTyping" = "%@ is typing";
"Group.MembersCount" = "%d member%@";
"Group.OnlineCount" = "%d online";
"Typing.PeopleTyping" = "%d people are typing";
"Group.AddMembers" = "Add Members";


"App.Name" = "Telegram";
"App.Connecting" = "connecting...";
"App.WaitingNetwork" = "waiting for network";


"ChatMedia.Audio" = "Audio";
"ChatMedia.Voice" = "Voice message";
"ChatMedia.Photo" = "Photo";
"ChatMedia.Contact" = "Contact";
"ChatMedia.Video" = "Video";
"ChatMedia.Location" = "Location";
"ChatMedia.File" = "File";
"ChatMedia.Unsupported" = "Unsupported";



"User.Unlock" = "Unblock";
"User.Block" = "Block";
"User.BlockUser" = "Block %@";
"User.UnlockUser" = "Unblock %@";
"User.Blocked" = "User is blocked";
"User.AddToContacts" = "Add Contacts";
"User.Deleted" = "Deleted";
"User.Hidden" = "hidden";


"App.ConnectionError" = "Connection Error";
"App.ConnectionErrorDesc" = "Check your network connection and try again";

"App.MaxFileSize" = "Maximum file size is 1.5 GB";

"Auth.CantLogout" = "Can't logout";
"Auth.CheckConnection" = "Check your network connection and try again";

"Settings.CantUpdateFolder" = "Can't set this folder as default";
"Settings.ChooseAnotherFolder" = "Please choose a different folder";
"Settings.BlockUsers" = "Block Users";

"Cellular" = "Cellular";

"Message.Send.Compressing" = "compressing...";

"Search.Separator.Contact" = "contact";
"Search.Separator.Contacts" = "Contacts";

"Search.Separator.User" = "user";
"Search.Separator.Users" = "users";

"Search.Separator.Message" = "message";
"Search.Separator.Messages" = "messages";





"AccountSettings.ContactsSynced" = "Contacts synced";

"NewConversation.CreateBroadcast" = "Create Broadcast";
"NewConversation.CreateGroup" = "Create";
"NewConversation.CreateGroupChat" = "Create Group Chat";
"NewConversation.CreateSecretChat" = "Create Secret Chat";
"NewConversation.CreatingGroupChat" = "Group Chat";
"NewConversation.CreatingSecretChat" = "Secret Chat";
"NewConversation.GroupNamePlaceholder" = "Group name...";
"NewConversation.AddContact" = "Add Contact";





"Account.ImportContacts" = "Import Contacts";
"Account.Invisible" = "offline";
"Account.Online" = "online";
"Account.Offline" = "offline";
"Login.InvalidCode" = "Invalid code";
"Login.InvalidCountry" = "Invalid country";
"Login.InvalidPhoneNumber" = "Invalid phone number";
"Login.Country" = "country";
"Login.Description" = "Official Telegram Messenger client for OS X";
"Login.Label" = "Welcome to the official OS X app";
"Login.GetNewCode" = "Get a New Code";
"Login.GetCode" = "Next";
"Login.Error" = "Error ;(";
"Login.ExpiredCode" = "Expired code";
"Login.SmsCode" = "code";
"Login.PhonePlaceholder" = "your number";
"Registartion.FirstName" = "First Name";
"Registration.DeletePhoto" = "Delete Photo";
/* Вставить сюда  (Optional) если влезет. */
"Registration.LastName" = "Last Name";
"Registration.PhoneDialed" = "Telegram dialed your number";

"Registration.ChangePhoto" = "Change Photo";
"Registration.ChooseCountry" = "choose country";
"Registration.ChoosePhoto" = "Choose Photo";
"Registration.Continue" = "Continue Registration";
"Registration.StartMessaging" = "Start Messaging";
"Registration.AddPhoto" = "add\nphoto";



"SelfDestruction.DisableTimer" = "disabled the self-destruct timer";
"SelfDestruction.SetTimer" = "set the self-destruct timer to %@";
"SelfDestruction.SetRandomTimer" = "set the self-destruct timer to %d seconds";

"Message.Send" = "Send";
"Messages.SharingContact" = "Sharing contact";

"Messages.SendPlaceholder" = "Message...";

"Message.File.Download" = "Download";
"Messages.Selected.Forward" = "Forward";
"Messages.Selected.Delete" = "Delete";
"Message.ForwardedFrom" = "Forwarded message from ";
"message" = "message";
"messages" = "messages";
"MessageAction.Secret.CreatedSecretChat" = "created secret chat";
"MessageAction.ServiceMessage.ChangedGroupName" = "%@ changed group name to \"%@\"";
"MessageAction.ServiceMessage.RemovedGroupPhoto" = "%@ removed group photo";
"MessageAction.ServiceMessage.ChangedGroupPhoto" = "%@ changed group photo";
"MessageAction.ServiceMessage.InvitedGroup" = "%@ invited %@";
"MessageAction.ServiceMessage.JoinedGroup" = "%@ joined the group";
"MessageAction.ServiceMessage.KickedGroup" = "%@ kicked %@";
"MessageAction.ServiceMessage.CreatedChat" ="%@ created the group \"%@\"";
"MessageAction.ServiceMessage.LeftGroup" = "%@ left the group";
"MessageAction.Secret.CancelledSecretChat" = "Secret chat cancelled";
"MessageAction.Service.ChangedGroupName" = "renamed group";
"MessageAction.Service.RemovedGroupPhoto" = "removed group photo";
"MessageAction.Service.ChangedGroupPhoto" = "changed group photo";
"MessageAction.Service.InvitedGroup" = "invited";
"MessageAction.Service.JoinedGroup" = "joined the group";
"MessageAction.Service.KickedGroup" = "kicked";
"MessageAction.Service.CreatedChat" = "created the group \"%@\"";
"MessageAction.Service.LeftGroup" = "left the group";
/* Какая-то странная строчка: */
"MessageAction.Service.LeaveChat" = "Leave chat";
"MessageAction.Secret.WaitingToGetOnline" = "Waiting for %@ to get online...";
"MessageAction.Secret.TookScreenshot" = "took a screenshot";
"Message.Action.Forwarding" = "Forwarding";
"Messages.UnreadMessages" = "Unread messages";





"Month.GenApril" = "April";
"Month.GenAugust" = "August";
"Month.GenDecember" = "December";
"Month.GenFebruary" = "February";
"Month.GenJanuary" = "January";
"Month.GenJuly" = "July";
"Month.GenJune" = "June";
"Month.GenMarch" = "March";
"Month.GenMay" = "May";
"Month.GenNovember" = "November";
"Month.GenOctober" = "October";
"Month.GenSeptember" = "September";
"Month.ShortApril" = "Apr";
"Month.ShortAugust" = "Aug";
"Month.ShortDecember" = "Dec";
"Month.ShortFebruary" = "Feb";
"Month.ShortJanuary" = "Jan";
"Month.ShortJuly" = "Jul";
"Month.ShortJune" = "Jun";
"Month.ShortMarch" = "Mar";
"Month.ShortMay" = "May";
"Month.ShortNovember" = "Nov";
"Month.ShortOctober" = "Oct";
"Month.ShortSeptember" = "Sep";



"Search.More" = "%d more..";









"Notification.MessageLifetime1d" = "1 day";
"Notification.MessageLifetime1h" = "1 hour";
"Notification.MessageLifetime1m" = "1 minute";
"Notification.MessageLifetime1w" = "1 week";
"Notification.MessageLifetime2s" = "2 seconds";
"Notification.MessageLifetime5s" = "5 seconds";
"notifications" = "notifications";


"Message.File.Open" = "Open";




"Attach.Picture" = "Photo";
"Attach.TakePhoto" = "Take Photo";
"Attach.Video" = "Video";
"Attach.File" = "File";
"Attach.PictureOrVideo" = "Photo or Video";



"Preferences" = "Preferences";

"Registration" = "Registration";


"Settings.ResyncDescription" = "Remember: for now, the app needs syncing whenever you add new contacts to iCloud.";

"Account.UpdateProfilePhoto" = "Update Profile Photo";






"Profile.Save" = "Save";


"MediaPreview.SaveItem" = "Save Item As...";
"MediaPreview.SaveToDownloads" = "Save to Downloads";
"MediaPreview.NextItem" = "Next Item";
"MediaPreview.PreviousItem" = "Previous Item";


"Search" = "Search";




"Notification.SecretMessage" = "You have a new message";



"Settings" = "Settings";





"Conversation.ShowProfile" = "Show %@'s Profile";
"Conversation.ShowGroupInfo" = "Show Group Info";
"Conversation.StartSecretChat" = "Start Secret Chat";
"Conversation.CantForwardSecretMessages" = "Unfortunately, you cannot forward messages to secret chats";
"Conversation.CantShareContactToSecretChat" = "Unfortunately, you cannot share contacts to secret chats";
"Conversation.Confirm.ClearHistory" = "Would you like to delete all messages in this chat?";
"Conversation.Confirm.LeaveAndClear" = "Would you like to leave this group and clear message history?";
"Conversation.Confirm.DeleteAndClear" = "Would you like to delete this chat and clear the message history?";
"Conversation.Confirm.UndoneAction" = "This action cannot be undone.";
"Conversation.Confirm.SendFromClipboard" = "Would you like to send %d files from clipboard?";
"Conversation.Confirm.SendThisFile" = "Would you like to send this file?";
"Conversation.Confirm.SendThisPicture" = "Would you like to send this picture?";
"Conversation.Confirm.SendThisVideo" = "Would you like to send this video?";
"Conversation.Confirm.SendThisFileDescription" = "You can always send a file by copying it and pasting into a Telegram chat.";
"Conversation.Confirm.SendThisPictureDescription" = "You can always send a picture by copying it and pasting into a Telegram chat.";
"Conversation.Confirm.SendThisVideoDescription" = "You can always send a video by copying it and pasting into a Telegram chat.";
"Conversation.Confirm.SendThisPicturesDescription" = "You can always send pictures and files by copying them and pasting into a Telegram chat.";
"Conversation.Action.YouKickedGroup" = "You have been removed from the group";
"Conversation.Action.YouLeftGroup" = "You have left the group";
"Conversation.Actions.ReturnToGroup" = "Return to Group";
"Conversation.Actions.LeaveGroup" = "Leave Group";
"Conversation.Members" = "members";
"Conversation.Member" = "member";
"Conversation.DeleteSecretChat" = "Delete Secret Chat";
"Conversation.ShowEncryptionKey" = "Show Encryption Key";
"Conversation.Delete" = "Delete Chat";
"Conversation.Back" = "Back to Chat";
"Conversation.BackToInfo" = "Back to Group Info";
"Conversation.DropTitle" = "Drop files here to send them";
"Conversation.DropQuickDescription" = "in a quick way";
"Conversation.ScrollToBottom" = "Scroll down to latest messages";
"Conversation.DropAsFilesDescription" = "without compression";
"Conversation.Send.FilesSizeError" = "The files %@ exceed the maximum size.";
"Conversation.NoMessages" = "No messages here yet...";
"Conversation.Mute" = "Mute";
"Conversation.Unmute" = "Unmute";
"Conversation.OpenConversation" = "Open Chat";
"Conversation.Filter.Photos" = "Photos";
"Conversation.Filter.Video" = "Video";
"Conversation.Filter.Files" = "Shared Files";
"Conversation.Filter.Audio" = "Audio";
"Conversation.Filter.PhotoVideo" = "Photos and Video";
"Conversation.ShowMedia" = "Show Media";
"Conversation.SelectToForward" = "Select a user or chat to forward message from %1$@";
"Conversation.SelectToForwards" = "Select a user or chat to forward messages from %1$@";
"Conversation.SelectToShareContact" = "Select a user or chat to share %@'s contact";
"Conversation.ClearMessageHistory" = "Clear Message History";
"Conversation.CopyToClipboard" = "Copy to Clipboard";
"Conversation.DeleteAndExit" = "Delete and Exit";
"Conversation.CopyURL" = "Copy URL";
"Conversation.Menu.SetSelfDestruct" = "Set Self-Destruct Timer";
"Conversation.SelectConversation" = "Select a chat to start messaging";


"Profile.MobilePhone" = "mobile";
"Profile.SharedMedia" = "Shared Media";
"Profile.SendMessage" = "Send Message";
"Profile.ShareContact" = "Share Contact";
"Profile.Edit" = "Edit";
"Profile.edit" = "edit";
"Profile.Save" = "Save";
"Profile.DeleteAndExit" = "Delete and Exit";
"Profile.DeleteContact" = "Delete Contact";
"Profile.CreatedBy" = "created by ";
"Profile.You" = "You";
"Profile.Error.CantUpdatePhoto" = "Can't update profile photo";
"Profile.Cancel" = "Cancel";
"Profile.CancelPhotoUpload" = "Cancel Uploading";
"Profile.CantUpdate" = "Can't update profile";
"Profile.CantUpdatePhoto" = "Can't update profile photo";
"Profile.Back" = "Back";
"Profile.ClearHistory" = "Clear Message History";
"Profile.DeleteConversation" = "Delete Chat...";
"Profile.Done" = "Done";
"BackToProfile" = "Back to Profile";
"Profile.RemovePhoto" = "Remove Photo";
"Profile.UpdatePhoto" = "Update Photo";
"Profile.SetGroupPhoto" = "Set Group Photo";
"Profile.SmallPhoto" = "Photo too small";






"Telegram Messenger" = "Telegram Messenger";


"Time.at" = "at";
"Time.last_seen" = "last seen";
"Time.today" = "today";
"Time.tomorrow" = "tomorrow";
"Time.yesterday" = "yesterday";


"App.updating" = "updating...";



"Attach.WebSearch" = "Web Search";

"Weekday.Friday" = "Friday";

"Weekday.Monday" = "Monday";

"Weekday.Saturday" = "Saturday";

"Weekday.ShortFriday" = "Fri";

"Weekday.ShortMonday" = "Mon";

"Weekday.ShortSaturday" = "Sat";

"Weekday.ShortSunday" = "Sun";

"Weekday.ShortThursday" = "Thu";

"Weekday.ShortTuesday" = "Tue";

"Weekday.ShortWednesday" = "Wed";

"Weekday.Sunday" = "Sunday";

"Weekday.Thursday" = "Thursday";

"Weekday.Tuesday" = "Tuesday";

"Weekday.Wednesday" = "Wednesday";

"WiFi" = "Wi-Fi";








"Notification.MessageLifetime2s" = "2 seconds";
"Notification.MessageLifetime5s" = "5 seconds";
"Notification.MessageLifetime1m" = "1 minute";
"Notification.MessageLifetime1h" = "1 hour";
"Notification.MessageLifetime1d" = "1 day";
"Notification.MessageLifetime1w" = "1 week";

"DefaultSoundName" = "Default";

"Date.DialogDateFormat" = "{month} {day}";


"Confirm.TerminateSessions" = "Are sure you want to terminate all other sessions?";
"Confirm.SuccessResetSessions" = "All other sessions terminated successfully";
"Confirm.ConfirmLogout" = "You are sure you want to log out?";
"Confirm.ClearHistory" = "Clear History";
"Alert.Error" = "Error";
"Alert.Confirm" = "Confirm";


"AddContact.FirstNamePlaceholder" = "First Name";
"AddContact.LastNamePlaceholder" = "Last Name (optional)";
"AddContact.PhoneNumberPlaceholder" = "Mobile";
"AddContact.AddContact" = "Add Contact";

"AddContact.NotRegistredTitle" = "Not Telegram Contact";
"AddContact.NotRegistredDescription" = "This contact is not registered in Telegram yet. You will be able to send them a Telegram message as soon as they sign up.";

"Messages.AddContact" = "Add";

"Time.agoHour" = "%d hour ago";
"Time.agoHours" = "%d hours ago";
"Time.agoMinute" = "%d minute ago";
"Time.agoMinutes" = "%d minutes ago";
"Time.justnow" = "just now";

"Secret.SelfDestruct.Off" = "Off";
"Secret.SelfDestruct.2s" = "2s";
"Secret.SelfDestruct.5s" = "5s";
"Secret.SelfDestruct.1m" = "1 minute";
"Secret.SelfDestruct.1h" = "1 hour";
"Secret.SelfDestruct.1d" = "1 day";
"Secret.SelfDestruct.1w" = "1 week";

"Message.File.ShowInFinder" = "Show in Finder";

"Delete" = "Delete";

"Edit.selectMessage" = "%lu message selected";
"Edit.selectMessages" = "%lu messages selected";

"Photo" = "Photo";



"Settings.OpenLinksBackground" = "Open Links in background";
"Settings.PrivateChats" = "Private Chats";
"Settings.Groups" = "Groups";


"Settings.OpenLinksBackground" = "Open Links in background";

"Settings.SendAsEnter" = "Enter";
"Settings.SendAsCmdEnter" = "⌘ + Enter";

"Settings.OnlineFocused" = "App Focused";
"Settings.OnlineLaunch" = "App Running";

"Settings.SoundEffects" = "Sound Effects";

"Settings.online_when_desc" = "Online when:";
"Settings.auto_download_desc" = "Auto downloads:";
"Settings.video_desc" = "Video:";
"Settings.documents_desc" = "Documents:";
"Settings.voice_messages_desc" = "Voice messages:";
"Settings.file_size_limit_desc" = "File size limit:";
"Settings.send_message_desc" = "Send message:";
"Settings.save_documents_to_desc" = "Save documents to:";
"Settings.sound_notifications_desc" = "In-App Sound:";
"Settings.other_desc" = "Other:";

"Settings.cache_desc" = "Cache:";
"Settings.sessions_desc" = "Sessions:";
"Settings.cache_sub_desc" = "Deleting all pictures, video and voice messages in cache folder";
"Settings.sessions_sub_desc" = "Logs out all devices expect for the current one";
"Settings.account_desc" = "Account:";

"Settings.clear_all_the_cache_button" = "Clear all the cache";
"Settings.terminate_all_other_sessions_button" = "Sessions";
"Settings.log_out_button" = "Log out";

"Settings.Settings" = "Settings";
"Settings.BlackList" = "Black List";


"Confirm" = "Confirm";
"Yes" = "Yes";
"No" = "No";
"Cancel" = "Cancel";

"Settings.General" = "General";
"Settings.Account" = "Account";

"MessageAction.Secret.UserJoined" = "%@ joined your secret chat.";
"MessageAction.Secret.CreatedSecretChat" = "created secret chat";

"Secret.join.description" = "You have invited %1$@ to \njoin a secret chat.";
"Secret.join.invitedDescription" = "%1$@ invited you to \njoin a secret chat.";
"Secret.join.secret_chats" = "\n\nSecret chats:\n";
"Secret.join.desc1" = " Use end-to-end encryption\n";
"Secret.join.desc2" = " Leave no trace on Telegram servers\n";
"Secret.join.desc3" = " Have a self-destruct timer\n";
"Secret.join.desc4" = " Do not allow forwarding\n";


"Settings.chooseFolder" = "Choose...";


"Login.code" = "code";
"Login.willCallYou" = "Telegram will call you in %d:%@";
"Login.phoneNumber" = "phone number";

"Audio.Downloading" = "%1$@ downloading...";
"Audio.Uploading" = "%1$@ uploading....";

"Document.Downloading" = "%.0f%% downloading";
"Document.Uploading" = "%.0f%% uploading";

"MessageService.Action.JoinedSecretChat" = "Joined the secret chat";

"Attach.Location" = "Location";
"Attach.PictureOrVideo" = "Photo or Video";

"Audio.ReleaseOut" = "Release outside this field to cancel\nPress Command+R for quick record";
"Messages.scrollToBottomNewMessage" = "%d new";
"Messages.scrollToBottomNewMessages" = "%d new";

"Emoji.NoRecents" = "No recent emojis";

"Profile.SetEncryptedTTL" = "Self-Destruct Timer";
"Profile.ShowEncryptedKey" = "Encryption Key";

"Search.LoadingMessages" = "loading messages";
"Messages.ForwardedMessages" = "forwarded messages";

"Messages.Error.Delete" = "Delete";
"Messages.Error.Resend" = "Resend";

"Notification.NewAuthDetected" = "%@,\nWe detected a login into your account from a new device on %@\n\nDevice: %@\nLocation: %@\n\nIf this wasn't you, you can go to Settings — Privacy and Security — Sessions and terminate that session.\n\nIf you think that somebody logged in to your account against your will, you can enable two-step verification in Privacy and Security settings.\n\nThanks,\nThe Telegram Team";


"Alert.MessagesSendError.Desc" = "Your message could not be sent";
"Alert.MessagesSendError.Text" = "An error occurred while sending the previous message. Would you like to resend it ?";
"Alert.Button.TryAgain" = "Try Again";
"Alert.Button.Delete" = "Delete";
"Alert.Button.Ignore" = "Ignore";

"Messages.MessagesTopInfoActionUnblockUser" = "This user is blocked, so he can't answer your messages.";
"Messages.MessagesTopInfoActionShareContact" = "This user doesn’t have your contact info.";
"Messages.MessagesTopInfoActionAddContact" = "This user is not in your contacts.";

"Messages.MessagesTopInfoActionAddContact.Button" = "Add to Contact";
"Messages.MessagesTopInfoActionShareContact.Button" = "Share My Contact Info";
"Messages.MessagesTopInfoActionUnblockUser.Button" = "Unblock";



"Connecting.Connecting" = "Connecting";
"Connecting.Connected" = "Connected!";
"Connecting.WaitingNetwork" = "Waiting for Network";
"Connecting.Updating" = "Updating";
"Connecting.Updated" = "Updated!";

"SharedMedia.None" = "None";

"MediaPreview.Forward" = "Forward to...";
"MediaPreview.Delete" = "Delete";


"Broadcast.Create" = "Create";
"Broadcast.statusMore" = "and %lu more";
"Broadcast.participantsTitle" = "%lu participants";
"Broadcast.participantTitle" = "%lu participant";

"MessageAction.ServiceMessage.CreatedBroadcast" ="created a broadcast list";
"Conversation.CantForwardToBroadcast" = "Unfortunately, you cannot forward messages to a broadcast";
"NewConversation.CreatingBroadcast" = "Broadcast";

"Conversation.ShowBroadcastInfo" = "Show Broadcast Info";

"Settings.LaunchOnStartup" = "Launch at Startup";

"App.startupAtLaunch" = "Launch at Startup";
"App.startupAtLaunchDesc" = "Press Yes if you would like the App to launch on system startup.";

"Notification.UserRegistred" = "joined Telegram";



"ComposeMenu.CreateGroup" = "New Group";
"ComposeMenu.Broadcast" = "Broadcast Lists";
"ComposeMenu.SecretChat" = "New Secret Chat";

"Compose.GroupTitle" = "New Group";
"Compose.SecretChat" = "New Secret Chat";
"Compose.BroadcastTitle" = "Broadcast List";


"Compose.Back" = "Back";
"Compose.Next" = "Next";
"Compose.Done" = "Done";
"Compose.Create" = "Create";

"Compose.Contacts" = "Contacts";
"Compose.AddMembers" = "Add";

"Compose.GroupNamePlaceHolder" = "Group Name";
"Compose.NewBroadcastList" = "New List";


"Account.EditProfile" = "Edit Profile";

"Account.ChatSettings" = "Chat Settings";
"Account.BlockedUsers" = "Blocked Users";
"Account.SecuritySettings" = "Security Settings";



"Tab.Contacts" = "Contacts";
"Tab.Chats" = "Chats";
"Tab.Settings" = "Settings";


"Auth.ForceLogout" = "Press OK to force logout";
"Account.ExportCard" = "Export Your Card";
"UserCard.Export" = "Copy to Clipboard";
"CardImport.ErrorTextUserNotExist" = "Error, user not found";
"CardImport.ErrorDescUserNotExist" = "Check card string";

"Login.EnterCodeFromApp" = "Please enter the code you've just received in Telegram on your other device.";
"Login.SendSmsIfNotReceivedAppCode" = "Haven't received the code?";

"UserCard.ExportDesc" = "You can share this card with other Telegram users, so that they can contact you without knowing your phone number. Only available for OSX users at the moment, coming soon to other apps.";

"Login.WeSendSms" = "We have sent you a code via SMS. Please enter it above.";



"Search.Cancel" = "Cancel";

"Context.Quote" = "Quote";


"Conversation.Confirm.SendThisGif" = "Would you like to send this gif?";
"Conversation.Confirm.SendThisGifDescription" = "You can always send a gif by copying it and pasting into a Telegram chat.";





"BlockedUsers.NoBlockedUsers" = "You will not receive messages from people \non your block list";
"BlockedUsers.BlockedUsers" = "Blocked Users";
"Compose.BlockUsers" = "Block";
"GeneralSettings.AutoVideoDownloadHeader" = "AUTOMATIC VIDEO DOWNLOAD";
"GeneralSettings.AutoAudioDownloadHeader" = "AUTOMATIC AUDIO DOWNLOAD";
"Settings.SoundNotification" = "Sound Notification";
"GeneralSettings.General" = "General";
"Settings.AdvancedSettings" = "Advanced Settings";
"Settings.SecuritySettings" = "Security Settings";
"GeneralSettings.Security" = "Security";
"Settings.ClearCache" = "Clear Cache";
"Settings.ClearCacheDescription" = "Delete all media and files in the cache folder";
"Settings.TerminateOtherSessions" = "Active Sessions";
"Settings.TerminateOtherSessionsDescription" = "Logs out all devices excpect the current one";
"Account.SetProfilePhoto" = "Set Profile Photo";
"Account.General" = "General";
"Account.UserName" = "Username";
"Account.About" = "About";
"Account.FAQ" = "Telegram FAQ";
"Account.AskQuestion" = "Ask a Question";
"Profile.BlockContact" = "Block User";
"Profile.UnblockContact" = "Unblock User";
"Chat.Kick" = "Kick";
"Profile.Info" = "Info";
"UserName.placeHolder" = "@Enter your username";
"Profile.ChangeUserName" = "Change Username";
"UserName.description" = "You can choose a username on Telegram. If you do, other people will be able to find you by this username and contact you without knowing your phone number.\n\nYou can use a-z, 0-9 and underscores. Minimum length is 5 characters.";
"Username.setName" = "Set Username";
"Profile.Media" = "Media";
"Profile.DeleteAll" = "Delete All";
"Profile.DeleteBroadcast" = "Delete Broadcast";

"Context.OpenInFinder" = "Open in Finder";
"Context.SaveAs" = "Save As...";
"Context.CopyToClipBoard" = "Copy to Clipboard";
"Context.Forward" = "Forward";
"Context.Delete" = "Delete";

"UpdateNotification.Alert" = "Alert";
"Profile.username" = "username";
"Search.Separator.GlobalSearch" = "Global Search";

"UserNameExport.UserNameNotFound" = "User not found";
"UserNameExport.UserNameNotFoundDescription" = "A user with this username does not exist on Telegram";

"AddContactController.Addcontact" = "Add Contact";

"UserName.avaiable" = "%@ is available.";

"USERNAME_INVALID" = "Sorry, this username is invalid.";
"USERNAME_IS_ALREADY_TAKEN" = "Sorry, this username is already taken.";
"USERNAME_MIN_SYMBOLS_ERROR" = "A username must have at least 5 characters.";
"USERNAME_CANT_FIRST_NUMBER" = "Sorry, a username can't start with a number.";

"Settings.NotificationTone" = "Notification Tone";
"Notifications" = "Notifications";
"Settings.MessageNotifications" = "Message Notification";



"Notification.MessageLifetimeSeconds" = "%d second%@";
"Notification.MessageLifetimeMinutes" = "%d minute%@";
"Notification.MessageLifetimeHours" = "%d hour%@";
"Notification.MessageLifetimeDays" = "%d day%@";
"Notification.MessageLifetimeWeeks" = "%d week%@";
"Secret.SelfDestruct.RandomSecond" = "%d second";
"Secret.SelfDestruct.RandomSeconds" = "%d seconds";
"Close" = "Close";
"MediaPreview.GoToMessage" = "Go To Message";

"PhotoViewer.Forward" = "Forward";
"PhotoViewer.Delete" = "Delete";
"PhotoViewer.SaveAs" = "Save As";
"PhotoViewer.Goto" = "Show Message";
"PhotoViewer.posOfCount" = "%lu of %lu";
"Settings.EmojiReplaces" = "Automatically convert to Emoji";

"PrivacyAndSecurity.PrivacyHeader" = "PRIVACY";
"PrivacyAndSecurity.SecurityHeader" = "SECURITY";
"PrivacyAndSecurity.DeleteAccountHeader" = "DELETE MY ACCOUNT";

"PrivacyAndSecurity.BlockedUsers" = "Blocked Users";
"PrivacyAndSecurity.LastSeen" = "Last Seen";
"PrivacyAndSecurity.TerminateSessions" = "Active Sessions";
"PrivacyAndSecurity.Logout" = "Log Out";
"PrivacyAndSecurity.DeleteAccount" = "If Away For";

"LastSeen.longTimeAgo" = "last seen a long time ago";
"LastSeen.Recently" = "last seen recently";
"LastSeen.Monthly" = "last seen within a month";
"LastSeen.Weekly" = "last seen within a week";
"PrivacyAndSecurity.Header" = "Privacy and Security";
"PrivacySettingsController.Header" = "Last Seen";
"PrivacySettingsController.Everbody" = "Everybody";
"PrivacySettingsController.MyContacts" = "My Contacts";
"PrivacySettingsController.Nobody" = "Nobody";
"PrivacySettingsController.NeverShare" = "Never Share";
"PrivacySettingsController.AlwaysShare" = "Always Share";
"PrivacySettingsController.NeverShareWith" = "Never Share With";
"PrivacySettingsController.AlwaysShareWith" = "Always Share With";
"PrivacySettingsController.UserCount" = "%d user";
"PrivacySettingsController.UsersCount" = "%d users";
"PrivacySettingsController.AddUsers" = "Add Users";
"PrivacyUserListController.NoUsers" = "Click add (+) button to add users.";
"Remove" = "Remove";
"Account.Privacy" = "Privacy and Security";
"PhotoViewer.CopyToClipboard" = "Copy to Clipboard";
"PrivacyUserListController.Header" = "Choice Users";
"PhoneChangeAlertController.Description" = "You can change your Telegram number here. Your account and all your cloud data — messages, media, contacts, etc. will be moved to the new number.\n\n %1$@Important:%2$@ all your Telegram contacts will get your %3$@new number%4$@ added to their address book, provided they had your old number and you haven't blocked them in Telegram.";
"PhoneChangeAlertController.ChangePhone" = "Change Number";
"PhoneChangeController.Header" = "Change Number";
"PhoneChangeController.Next" = "Next";
"PhoneChangeController.Description" = "We will send an SMS with a confirmation code to\nyour new number.";
"Account.PhoneNumber" = "Phone Number";
"PhoneChangeControlller.AlertHeader" = "Changing error";
"PHONE_NUMBER_OCCUPIED"	= "An error occurred. Please try again later.";
"PHONE_NUMBER_INVALID" = "Invalid phone number. Please try again.";
"PhoneChangeController.SmsPlaceholder" = "Code";
"PhoneChangeConfirmController.SentCodeDescription" = "We have sent you an SMS with the code";
"PhoneChangeConfirmController.sendCall" = "Telegram will call you in %@";
"PhoneChangeConfirmController.phoneDialed" = "Telegram dialed your number";

"Alert.Forward" = "Forward";
"Alert.ForwardTo" = "Forward to %@?";

"TL_sendMessageTypingAction" = "%@ is typing";
"TL_sendMessageUploadPhotoAction" = "%@ is sending photo";
"TL_sendMessageRecordVideoAction" = "%@ is recording video";
"TL_sendMessageUploadVideoAction" = "%@ is sending video";
"TL_sendMessageRecordAudioAction" = "%@ is recording audio";
"TL_sendMessageUploadAudioAction" = "%@ is sending audio";
"TL_sendMessageUploadDocumentAction" = "%@ is sending file";
"TL_sendMessageGeoLocationAction" = "%@ is choosing geo";
"TL_sendMessageChooseContactAction" = "%@ is choosing contact";

"Settings.iCloudSynch" = "iCloud contacts synchronization";
"Profile.Photos" = "Photos";
"Settings.BigFont" = "Use Large Fonts";
"Quit" = "Quit";
"Settings.StatusBarIcon" = "Status Bar Icon";

"PHONE_CODE_INVALID" = "Phone code invalid. Please try again.";
"Password.password" = "Password";
"Password.EnterYourPassword" = "Enter Your Password";
"Password.ResetPassword" = "Delete Account";
"Password.logout" = "Log Out";
"Password.resetAlert" = "Are you sure? This action cannot be undone";
"Password.confirm" = "Confirm";
"PASSWORD_HASH_INVALID" = "Incorrect password. Please try again.";


"AccountDaysTTL30" = "1 month";
"AccountDaysTTL90" = "3 months";
"AccountDaysTTL182" = "6 months";
"AccountDaysTTL365" = "1 year";

"Profile.SharedMediaFiles" = "Shared Files";

"SharedMedia.NoSharedMedia" = "Share photos and videos in this chat\n— or this paperclip stays unhappy.";
"SharedMedia.NoFiles" = "You can send and receive\nfiles of any type up to 1.5 GB each\nand access them anywhere.";

"Notification.EnableInDays" = "in %d days";
"Notification.EnableInHours" = "in %d hours";
"Notification.EnableInMinutes" = "in %d minutes";
"Notification.EnableInSeconds" = "in %d seconds";

"Notification.EnableInDay" = "in %d day";
"Notification.EnableInHour" = "in %d hour";
"Notification.EnableInMinute" = "in %d minute";
"Notification.EnableInSecond" = "in %d second";

"Notification.Enabled" = "Enabled";
"Notification.Disabled" = "Disabled";

"Notifications.Menu.Enable" = "Enable";
"Notifications.Menu.Mute1Hour" = "Mute for 1 hour";
"Notifications.Menu.Mute8Hours" = "Mute for 8 hours";
"Notifications.Menu.Mute2Days" = "Mute for 2 days";
"Notifications.Menu.Disable" = "Disable";

"Context.OpenWith" = "Open With";
"Context.Other" = "Other...";
"Context.Share" = "Share";

"PrivacyAndSecurity.PassCode" = "Passcode";
"PasscodeSettings.Header" = "Passcode";
"PasscodeSettings.TurnOffPasscode" = "Turn Passcode Off";
"PasscodeSettings.TurnOnPasscode" = "Turn Passcode On";
"PasscodeSettings.ChangePasscode" = "Change Passcode";
"PasscodeSettings.AutoLock" = "Auto-Lock";

"Passcode.EnterYourNewPasscode" = "Enter your new passcode";
"Passcode.EnterYourOldPasscode" = "Enter your old passcode";
"Passcode.ReEnterYourPasscode" = "Re-Enter your passcode";
"Passcode.EnterYourPasscode" = "Enter your passcode";
"Passcode.EnterPlaceholder" = "passcode";


"Passcode.AutoLockTime0" = "Disabled";
"Passcode.AutoLockTime60" = "if away for 1 min";
"Passcode.AutoLockTime300" = "if away for 5 min";
"Passcode.AutoLockTime3600" = "if away for 1 hour";
"Passcode.AutoLockTime18000" = "if away for 5 hours";

"Alert.Share" = "Share Contact";
"Alert.ShareTo" = "Share Contact to %@?";

"Context.Reply" = "Reply (double click)";
"ChatMedia.Sticker" = "Sticker";
"Context.AddCustomSticker" = "Add Sticker to Emoji Panel";

"PrivacyAndSecurity.TwoStepVerification" = "Two-Step Verification";



"PasswordSettings.SetupHintTitle" = "Password Hint";
"PasswordSettings.SetupHint" = "Please create a hint for your password";

"PasswordSettings.YourPassword" = "Your Password";
"PasswordSettings.TurnOnPassword" = "Set Additional Password";
"PasswordSettings.TurnOffPassword" = "Turn Password Off";
"PasswordSettings.ChangePassword" = "Change Password";
"PasswordSettings.ChangeRecoveryEmail" = "Change Recovery E-Mail";
"PasswordSettings.SetRecoveryEmail" = "Set Recovery E-Mail";
"PasswordSettings.TurnOnPasswordDescription" = "You can set a password that will be required when you log in from a new device in addition to the SMS code.";
"PasswordSettings.SetPassword" = "Please enter your new password";
"PasswordSettings.Next" = "Next";
"PasswordSettings.ConfirmPassword" = "Please re-enter your new password";
"PasswordSettings.RecoveryEmail" = "Recovery E-Mail";
"PasswordSettings.RecoveryEmailDesc" = "Please add your valid e-mail. It is the only way to recover a forgotten password.";
"PasswordSettings.Skip" = "Skip";
"PasswordSettings.SkipAlert" = "No, seriously";
"PasswordSettings.SkipAlertDescription" = "If you forget your password, you will lose access to your Telegram account. There will be no way to restore it.";

"PasswordSettings.InputPassword" = "Enter your password";
"PasswordSettings.InputNewPassword" = "Enter your new password";

"PasswordSettings.AlertConfirmEmail" = "Almost there!";
"PasswordSettings.AlertConfirmEmailDescription" = "Please check your e-mail (don't forget the spam folder) to complete Two-Step Verification setup.";
"PasswordSettings.AlertSuccessActivatedDescription" = "Your password for Two-Step Verification is now active.";
"PasswordSettings.AlertSuccessDeactivatedDescription" = "Your password for Two-Step Verification has been deactivated.";
"PasswordSettings.AlertSuccessChangedDescription" = "Your password for Two-Step Verification was changed successfully.";



"EnterPassword.EnterPasswordDescription" = "You have enabled Two-Step Verification, so your account is protected with an additional password.";
"EnterPassword.forgotPassword" = "Forgot Password?";
"Alert.Sorry" = "Sorry";
"PASSWORD_RECOVERY_NA" = "Since you haven't provided a recovery e-mail when setting up your password, your remaining options are either to remember your password or to reset your account.";


"EnterPassword.ResetAccount" = "RESET MY ACCOUNT";
"EnterPassword.ResetAccountDescription" = "You will lose all your chats and messages, along with any media and files you shared, if you proceed with resetting your account.";
"Alert.Warning" = "Warning";

"Password.ResetAlertDescription" = "This action can not be undone.\n\nIf you reset your account, all your messages and chats will be deleted.";

"Password.SentRecoryCode" = "We have sent a recovery code to the e-mail you provided:\n\n%@";

"EnterPassword.EnterCodeDescription" = "Please check your e-mail and enter the 6-digit code we have sent here.";
"EnterPassword.AlertTroubleEmailAccess" = "If you can't restore access to the e-mail, your remaining options are either to remember your password or to reset your account.";
"EnterPassword.TroubleEmailAccess" = "Having trouble accessing your e-mail?";
"EnterPassword.BadEmailCode" = "Incorrect E-Mail code, please check and try again.";

"PasswordSettings.AbortPassword" = "Abort two-step verification setup";
"PasswordSettings.ConfrimEmailDescription" = "Please follow these steps to complete Two-Step Verification Setup:\n\n1. Check your e-mail (don't forget the spam folder): %@\n\n2. Click on the validation link.";

"PasswordSettings.AdditionDescription" = "You can set a password that will be required when you log in from a new device in addition to the SMS code.";

"Authorization.Authorizations" = "Sessions";
"Authorization.Official" = "official";
"Authorization.Unofficial" = "unofficial";
"Authorization.Reset" = "Reset";
"Forward.Message" = "%d forwarded message";
"Forward.Messages" = "%d forwarded messages";


"PasscodeSettings.TurnOnDescription" = "Note: if you forget the passcode, you'll need to log out. All secret chats will be lost.";

"AuthSessions.CurrentSession" = "CURRENT SESSION";
"AuthSessions.OtherSessions" = "OTHER SESSIONS";
"AuthSessions.TerminateOtherSessions" = "Terminate all other sessions";

"Webpage.GettingLinkInfo" = "Getting link info...";

"Settings.SmartNotifications" = "Smart Notifications";

"Confirm.ConfrimToJoinGroup" = "Do you want to join the group \"%@\"?";
"MessageAction.Service.JoinedGroupByLink" = "joined the group via invite link";

"Group.CopyExportChatInvite" = "Invite to Group by Link";
"ChatExportLink.CopyLink" = "Copy Invite Link";
"ChatExportLink.RevokeLink" = "Revoke Invite Link";
"ChatExportLink.RevokeConfirm" = "Are you sure you want to revoke this link? Once you revoke the link, no one will be able to join using it.";
"ChatExportLink.Alert.Revoked" = "The previous invite link is now inactive. A new one has been generated.";
"ChatExportLink.Description" = "Anyone who has Telegram installed will be able to join your group by opening this link.";

"AddAttachmentCaption" = "Add caption";
"USERS_TOO_MUCH" = "Sorry, this group is already full.";
"INVITE_HASH_EMPTY" = "Sorry, this group does not seem to exist.";
"INVITE_HASH_INVALID" = "Sorry, this group does not seem to exist.";
"INVITE_HASH_EXPIRED" = "Sorry, this group does not seem to exist.";


"PasswordSettings.EnabledDescription" = "You have enabled Two-Step verification.\nYou'll need the password you set up here to log in to your Telegram account.";
"StickerPack.AddStickerPack" = "Add %d Stickers";
"Settings.Stickers" = "Stickers";
"Sticker.StickerSettings" = "Sticker Settings";
"Stickers.StickersCount" = "%d stickers";
"Stickers.StickersPacksHeader" = "STICKER PACKS";
"Stickers.StickersSetDescription" = "\nArtists are welcome to add their own sticker packs using our @stickers bot.\n\nUsers can add stickers by right click on a sticker from a pack and choosing \"Add stickers\".";
"Context.AddStickers" = "Add to Stickers";
"Settings.MessageNotificationsAlert" = "Alert";
"Settings.MessageNotificationsHeader" = "MESSAGE NOTIFICATIONS";
"Settings.ChatSettingsHeader" = "CHAT SETTINGS";
"Context.CopyLink" = "Copy Link";
"Stickers.RemoveStickerAlert" = "Remove \"%@\"?";
"PhoneChange.PhoneOccupied" = "The number %@ is already connected to a Telegram account. Please delete that account before migrating to the new number.";

"NoAudioDescription" = "No Audio files found in this chat";
"LastSeen.Bot" = "bot";
"Profile.botInfo" = "about";
"Bot.WhatBotCanDo" = "What can this bot do?";

"Bot.onlySeenMessagesWithSlash" = "has no access to messages";
"Bot.botCanReadAllMessages" = "has access to messages";

"Profile.ShareBot" = "Copy bot URL";
"Bot.Start" = "Start";
"Bot.confirmAddBot" = "Add the bot to \"%@\"?";
"Bot.AlreadyInGroup" = "The bot is already a member of the group.";
"Profile.AddToGroup" = "Add To Group";
"Compose.ChooseGroup" = "Choose A Group";
"Bot.Help" = "Help";
"RestartBot" = "Restart Bot";
"StopBot" = "Stop Bot";
"Conversation.Filter.SharedLinks" = "Shared Links";
"Settings.Cache" = "Cache";
"Cache.Photos" = "Photos";
"Cache.Videos" = "Videos";
"Cache.AllCache" = "Clear all cached items";
"Cache.ClearAllCache" = "Remove all cached media. The media themselves will stay in your Telegram cloud and can be re-downloaded if you need them again.";
"Cache.ClearVideoCache" = "Remove all video files. The videos themselves will stay in your Telegram cloud and can be re-downloaded if you need them again.";
"Cache.ClearPhotoCache" = "Remove all cached photo files. The photos themselves will stay in your Telegram cloud and can be re-downloaded if you need them again. ";
"Cache.Description" = "All media will stay in the Telegram cloud and can be re-downloaded if your need it.";
"NotificationSettings.Description" = "You can set custom notifications for specific users and groups below.";
"NotificationSettings.ResetAllNotifications" = "Reset Custom Notifications";
"NotificationSettings.MessagePreview" = "Message Preview";
"NotificationSettings.Sound" = "Sound";
"Notifications" = "Notifications";
"NotificationSettings.ResetAllNotificationsConfirm" = "Are you sure you want to reset all individual notification settings?";
"SharedMedia.NoSharedLinks" = "All links shared in this chat will appear here.";
"DatabaseOptimizing" = "Optimizing database. It could take a minute, but please don't restart the app! Sorry for the wait, we only need to do this once.";
"Settings.AdvancedSettingsHeader" = "ADVANCED";


"Compose.NewChannel" = "New Channel";
"Compose.Members" = "Members";
"Compose.ChannelTitlePlaceholder" = "Channel Name";
"Compose.ChannelAboutPlaceholder" = "Description";
"Compose.ChannelAboutDescription" = "You can provide an optional description for your channel.";
"Channel.Discussion" = "Discussion";
"Channel.DiscussionEnableDescription" = "You can enable discussion. If you do, members will be able to send messages to the channel.";

"Compose.ChangeChannelLink" = "Link";
"Channel.SetChannelLinkPlaceholder" = "Channel Link";
"Channel.SetChannelLinkDescription" = "You can choose a channel name on **Telegram**. If you do, other people will be able to find your channel by this name.\n\nYou can use **a-z**, **0-9** and underscores. Minimum length is **5** characters.";
"Channel.Username.LinkHint" = "This link opens your channel in Telegram:[\nhttps://telegram.me/%@]";
"Channel.Username.InvalidTooShort" = "Channel names must have at least 5 characters.";
"Channel.Username.InvalidStartsWithNumber" = "Channel names can't start with a number.";
"Channel.Username.InvalidCharacters" = "Sorry, this name is invalid.";
"Channel.Username.InvalidTaken" = "Sorry, this name is already taken.";
"Channel.Username.CheckingUsername" = "Checking name...";
"Channel.Username.UsernameIsAvailable" = "%@ is available.";


"Compose.Save" = "Save";
"Compose.Skip" = "Skip";

"ComposeMenu.CreateChannel" = "New Channel";
"Profile.EditLink" = "Link";
"Profile.ShareLink" = "share link";
"Profile.EditAbout" = "About";
"Profile.About" = "about";
"Profile.LeaveChannel" = "Leave Channel";

"Profile.SetChannelPhoto" = "Set Channel Photo";
"Profile.OpenChannel" = "Open Channel";
"Conversation.Action.Share" = "Share";

"Channel.ShareCopyDescription" = "Copying link to pasteboard";

"Conversation.CantForwardMessagesToThisConversation" = "Can't forward messages to this conversation. Please, try later.";
"Conversation.Action.JoinToChannel" = "Join Channel";
"MessageAction.Service.ChannelCreated" = "channel created";
"Channel.showcomments" = "show comments";
"Conversation.ChannelTitle" = "channel";
"Message.Action.Service.ChannelEnableComments" = "comments are enabled";
"Message.Action.Service.ChannelDisableComments" = "comments are disabled";

"Channel.oneComment" = "+%d comment";
"Channel.manyComments" = "+%d comments";
"Channel.AccessHeader" = "ACCESS";
"Channel.AccessDescription" = "Moderators can remove comments by users and manage the channel's black list.\n\nModerators can't change the channel's name, link, photo and description.";
"Profile.EnableComments" = "Comments";
"Profile.Managment" = "Administrators";
"Channel.AddModeratorDescription" = "You can add administrators to help you manage your channel.";

"Channel.Creator" = "Creator";
"Channel.Editor" = "Administrator";
"Channel.Moderator" = "Administrator";
"Channel.DismissModeratorConfirm" = "Are you sure you want to dismiss this administrator?";
"Channel.DismissModerator" = "Dismiss Administrator";
"Channel.Managment" = "Administrators";
"Compose.ChannelBlackList" = "Banned users";
"Profile.ChannelMembers" = "Members";
"Profile.ChannelBlackList" = "Banned users";
"Channel.DeleteMessageModal" = "Delete";
"Channel.BanUserModal" = "Ban User";
"Channel.ReportSpamModal" = "Report Spam";
"Channel.DeleteAllMessagesModal" = "Delete all messages";
"Channel.DeleteMessagesModalHeader" = "Delete Messages";
"Compose.Unban" = "Unban";
"Channel.AddModerator" = "Add Administrator";
"Channel.Members" = "Members";
"Compose.Kick" = "Remove";

"MessageAction.Service.RemovedChannelPhoto" = "channel photo removed";
"MessageAction.Service.ChannelGroupName" = "channel renamed";
"MessageAction.Service.ChangedChannelPhoto" = "channel photo updated";
"Conversation.Action.CommentsBlocked" = "Comments are disabled";
"MessageAction.ServiceMessage.ChangedChannelPhoto" = "changed channel photo";
"MessageAction.ServiceMessage.RemovedChannelPhoto" = "removed channel photo";
"MessageAction.ServiceMessage.ChangedChannelName" = "changed channel name";
"Channel.MemberCount" = "%d member";
"Channel.MembersCount" = "%d members";
"USER_NOT_PARTICIPANT" = "%@ hasn't joined the channel yet. Do you want to invite them?";
"USER_NOT_MUTUAL_CONTACT" = "Sorry, if a person decides to leave, only mutual contact can bring them back (they need to have phone number, and you need theirs)";

"Channel.TypeHeader" = "CHANNEL TYPE";
"Channel.Public" = "Public";
"Channel.Private" = "Private";
"Channel.ChoiceTypeDescriptionPrivate" = "Private channels can only be joined via invite link.";
"Channel.ChoiceTypeDescriptionPublic" = "Public channels can be found in search, anyone can join them.";
"Channel.NewChannelSettingUpUserNameDescription" = "People can share this link with others and find your channel using Telegram search.";
"Channel.NewChannelSettingUpJoinLinkDescription" = "People can join your channel by following this link. You can revoke the link at any time.";
"Conversation.ShowChannelInfo" = "Show Channel Info";
"Channel.SetPublicUsernameDescription" = "Please choose a link for your public channel, so that people can find it in search and share with others.\n\nIf you're not interested, we suggest creating a private channel instead.";
"CHANNELS_ADMIN_PUBLIC_TOO_MUCH" = "Sorry, you have created too many public channels. You can either create a private channel or delete one of your existing channels first.";
"Profile.DeleteChannel" = "Delete Channel";
"Profile.ExportInviteLink" = "Invite Link";
"Channel.AddEditor" = "Add Administrator";
"USER_BLOCKED" = "Sorry, you can’t add this user to channels.";
"USER_ID_INVALID" = "User not found.";
"USER_BOT" = "Sorry, you can't add bots to channels at the moment.";
"USERS_TOO_MUCH" = "Sorry, this group is already full.";
"PEER_FLOOD" = "Sorry, you can only add mutual contacts at the moment.";
"MessageAction.Service.InvitedYouToChannel" = "added you to this channel";
"Channel.ChoiceTypeDescriptionPublic" = "Public channels can be found in search, anyone can join them.";

"Channel.Username.LinkHint" = "This link opens your channel in Telegram:[\nhttps://telegram.me/%@]";
"Channel.Username.InvalidTooShort" = "Channel names must have at least 5 characters.";
"Channel.Username.InvalidStartsWithNumber" = "Channel names can't start with a number.";
"Channel.Username.InvalidCharacters" = "Sorry, this name is invalid.";
"Channel.Username.InvalidTaken" = "Sorry, this name is already taken.";
"Channel.Username.CheckingUsername" = "Checking name...";
"Channel.Username.UsernameIsAvailable" = "%@ is available.";
"MessageAction.Service.YouChoinedToChannel" = "joined the channel";
"Settings.IncludeMutedUnread" = "Include muted chats in unread count";
"USER_ALREADY_PARTICIPANT" = "This user is already a member.";
"Messages.MessagesTopInfoActionReportSpam.Button" = "Report Spam";
"Messages.MessagesTopInfoActionReportSpam.ButtonCancel" = "Cancel";
"ReportSpam.ConfirmDescription" = "Are you sure you want to report spam from this user?";
"Messages.SharingLink" = "Share link";
"ShowConversationWithAnotherWindow" = "Open Conversation in a separate window";
"Conversation.Pin" = "Pin";
"Conversation.Pinned" = "Pinned";
"Conversation.Confirm.DeleteChannel" = "Delete Channel";
"Conversation.Confirm.DeleteChannelInfo" = "Wait! Deleting this channel will remove all members and all messages will be lost. Delete the channel anyway?";
"LockedChatHead.Description" = "App is locked with a passcode, please unlock from the main window.";
"Chat.SwitchAdminsDescription" = "All members can add new members, edit name and photo of the group.";
"Chat.SwitchAdminsDescriptionOff" = "Only admins can add and remove members, edit name and photo of the group.";
"Chat.SwitchAllAdmins" = "All Members Are Admins";
"Chat.Administrators" = "Administrators";
"Chat.ToggleUserToAdminConfirm" = "Set as admin?";
"Chat.ToggleAdminToUserConfirm" = "Remove admin?";


"Modern.SharedMedia.PhotoOrVideo" = "Photo Or Video";
"Modern.SharedMedia.PhotosAndVideos" = "Photos & Videos";
"Modern.SharedMedia.File" = "File";
"Modern.SharedMedia.Files" = "Files";
"Modern.SharedMedia.Audio" = "Audio";
"Modern.SharedMedia.Audios" = "Audios";
"Modern.SharedMedia.Link" = "Link";
"Modern.SharedMedia.Links" = "Links";
"Modern.Chat.Members" = "%d MEMBERS";
"Modern.Profile.SetAdmins" = "Add Admins";
"Modern.Chat.UpgrateToMegagroup" = "Upgrade to Supergroup";
"Modern.Chat.UpgradeToMegagroupDescription" = "To go over the %d members limit and get additional features, upgrade to a supergroup:\n• Supergroups can get up to %d members\n• New members see the entire chat history\n• Admins delete messages for everyone\n• Notifications are muted by default";
"Modern.Channel.InviteViaLink" = "Invite via Link";
"Modern.Channel.ChannelMembersDescription" = "Only channel administrators can see this list.";
"Compose.Edit" = "Edit";
"Compose.Done" = "Done";
"Channel.ChangeAboutDescription" = "You can provide an optional description for your channel.";
"Channel.ChangeDescriptionPlaceholder" = "Description";
"Alert.somethingIsWrong" = "Something is wrong, please try again.";
"Conversation.Action.ChatDeactivated" = "Chat is Deactivated";
"MessageAction.Service.ChannelMigrated" = "This group was upgraded to a supergroup";
"MessageAction.Service.ChatMigrated" = "This group was upgraded to a supergroup";
"Conversation.DeleteAndStopBot" = "Delete And Stop";

"Modern.Chat.UpgradeConfirmHeader" = "Supergroup";
"Modern.Chat.UpgradeConfirmDescription" = "Please note that group members will need to update their Telegram apps to the latest version to see your supergroup.";
"MessageAction.Service.Invited" = "invited";
"MessageAction.Service.InvitedUsers" = "invited users";
"Profile.ReportChannel" = "Report";
"Report.ReportOther" = "Other";
"Report.ReportPorno" = "Pornography";
"Report.ReportViolence" = "Violence";
"Report.ReportSpam" = "Spam";
"Report.AlertText" = "Thank You!";
"Report.AlertDescription" = "Your report will be reviewed by our team very soon.";
"Conversation.GroupTitle" = "group";

"USER_BLOCKED" = "Sorry, you can’t add this user to channels.";
"USERS_TOO_MUCH" = "Sorry, this group is already full.";
"USER_NOT_MUTUAL_CONTACT" = "Sorry, if a person decides to leave, only mutual contact can bring them back (they need to have phone number, and you need theirs)";
"ADMINS_TOO_MUCH" = "Sorry, you've reached the maximum number of admins for this group.";
"BOTS_TOO_MUCH" = "Sorry, you've reached the maximum number of bots for this group.";


"Channel.Comments.Moderator" = "Moderator";
"Channel.Comments.Editor" = "Editor";
"Compose.ChatAboutDescription" = "You can provide an optional description for your group.";
"Compose.ChannelEmptyBlackList" = "Blacklisted users are removed from the group and can only come back if invited by an admin.\nInvite links don't work for them.";
"Conversation.Confirm.DeleteSupergroupInfo" = "Wait! Deleting this group will remove all members and all messages will be lost. Delete the group anyway?";
"Conversation.Confirm.DeleteGroup" = "Delete Group";
"Group.AddModeratorDescription" = "You can add administrators to help you manage your group.";


"TL_sendMessageTypingAction_ConversationUser" = "typing";
"TL_sendMessageUploadPhotoAction_ConversationUser" = "sending photo";
"TL_sendMessageRecordVideoAction_ConversationUser" = "recording video";
"TL_sendMessageUploadVideoAction_ConversationUser" = "sending video";
"TL_sendMessageRecordAudioAction_ConversationUser" = "recording audio";
"TL_sendMessageUploadAudioAction_ConversationUser" = "sending audio";
"TL_sendMessageUploadDocumentAction_ConversationUser" = "sending file";
"TL_sendMessageGeoLocationAction_ConversationUser" = "choosing location";
"TL_sendMessageChooseContactAction_ConversationUser" = "choosing contact";
"ContextBot.Message.Via" = "via";
"Context.RemoveGif" = "Remove GIF";
"Context.AddGif" = "Add GIF";
"Settings.AutoplayGifs" = "Autoplay GIFs";
"Reply.Loading" = "Loading...";
"Context.OpenInQuickLook" = "Open In Quick Look";
"document" = "File";


"Secret.InactiveCap" = "Please focus the window to view messages in secret chat.";
"Conversation.SelectConversationToViewChatInfo" = "Select a chat to view info";
"Audio.QuickRecordRelease" = "Press Command+R to send voice message";
"PrivacyAndSecurity.Groups" = "Groups";
"TL_privacyKeyStatusTimestamp" = "Last Seen";
"TL_privacyKeyChatInvite" = "Group";
"SuperGroup.WhocanAddNewMembers" = "Who can add new members?";
"SuperGroup.InviteSettings.OnlyAdmins" = "Only Admins";
"SuperGroup.InviteSettings.AllMembers" = "All Members";
"PRIVACY_FIRST_TL_privacyKeyStatusTimestamp" = "Important: you won't be able to see Last Seen times for people with whom you don't share your Last Seen time. Approximate last seen will be shown instead (recently, within a week, within a month).";
"PRIVACY_LAST_TL_privacyKeyStatusTimestamp" = "These settings will override the values above.";
"PRIVACY_FIRST_TL_privacyKeyChatInvite" = "You can restrict who can add you to groups and channels with granular precision.";
"PRIVACY_LAST_TL_privacyKeyChatInvite" = "These users will or will not be able to add you to groups and channels regardless of the settings above.";
"PrivacySettingsController.NeverShare_TL_privacyKeyChatInvite" = "Never Allow";
"PrivacySettingsController.AlwaysShare_TL_privacyKeyChatInvite" = "Always Allow";
"PrivacySettingsController.NeverShare_TL_privacyKeyStatusTimestamp" = "Never Share";
"PrivacySettingsController.AlwaysShare_TL_privacyKeyStatusTimestamp" = "Always Share";
"USERS_TOO_FEW" = "Sorry, you can't create a group with these users due to their privacy settings.";
"USER_PRIVACY_RESTRICTED" = "Sorry, you cannot add %@ to %@ because of %@'s privacy settings.";
"groups" = "groups";
"channels" = "channels";
"Channel.SetMegagroupLinkDescription" = "You can choose a group name on **Telegram**. If you do, other people will be able to find your group by this name.\n\nYou can use **a-z**, **0-9** and underscores. Minimum length is **5** characters.";
"MEGAGROUPS_ADMIN_PUBLIC_TOO_MUCH" = "Sorry, you have created too many public groups. You can either create a private group or delete one of your existing groups.";
"Channel.SignMessagesDescription" = "Add names of the admins to the messsages they post.";
"Channel.SignMessages" = "Sign Messages";
"Conversation.Action.CopyShareLink" = "Copy Share Link";
"Message.Save" = "Save";
"Context.Edit" = "Edit";
"Settings.TripleLayout" = "Triple Layout";
"Channel.SilentModeOff" = "Members will be notified when you post";
"Channel.SilentModeOn" = "Members will not be notified when you post";
"Context.Pin" = "Pin";
"Context.Unpin" = "Unpin";
"Channel.admin" = "admin";
"Channel.ConfirmUnpin" = "Would you like to unpin this message?";
"Channel.ForceConvertChatAbilityDescription" = "**In supergroups:**\n• New members can see the full message history\n• Deleted messages will disappear for all members\n• Members can edit their own messages\n• Creator can set a public link for the group";
"Channel.ForceConvertChatAbilityNote" = "**Note**: This action can not be undone.";
"Conversation.ConvertToSuperGroup" = "Convert to Supergroup";
"MessageAction.Service.PinMessage" = "pinned \"%@\"";
"Pin.Ok" = "OK";
"Pin.OnlyPin" = "Only Pin";
"Pin.PinMessageAndNotifyDesc" = "Pin the message and notify all members of the group?";
"MessageAction.Service.PinnedMessage" = "pinned message";
"DeletedMessage" = "deleted message";
"Modern.Channel.GroupType" = "Group Type";

"Group.ChoiceTypeDescriptionPublic" = "Public groups can be found in search, chat history is available to everyone and anyone can join.";
"Group.ChoiceTypeDescriptionPrivate" = "Private groups can only be joined if you were invited or have an invite link.";
"Group.PrivateTypeUpJoinLinkDescription" = "People can join your group by following this link. You can revoke the link at any time.";
"Group.PublicTypeUpJoinLinkDescription" = "People can share this link with others and find your group using Telegram search.";
"Group.TypeHeader" = "GROUP TYPE";
"PinnedHeaderMessage" = "Pinned Message";


"Message.PinnedTextMessage" = "pinned \"%@\"";
"Message.PinnedDeletedMessage" = "pinned deleted message";
"Message.PinnedMediaHeader" = "pinned %@";

"ConvertGroupAlertWarning" = "Warning";
"ConvertGroupAlert" = "This action is irreversible. It is not possible to downgrade a supergroup to a regular group.";
"FLOOD_WAIT" = "Too many attempts, please try again in %d minutes";
"Messages.ConfirmDeleteMessage" = "Are you sure you want to delete %ld message";
"Messages.ConfirmDeleteMessages" = "Are you sure you want to delete %ld messages";
"Compose.MaxSelectChatUsers" = "You will be able to add more users after you finish creating the group and convert it to a supergroup.";
"Conversation.Action.Join" = "Join";

"Profile.bio" = "bio";
"Conversation.Delete.ConfirmLeaveSupergroup" = "Are you sure you want to leave the group?";
"Conversation.Delete.ConfirmLeaveChannel" = "Are you sure you want to leave the channel?";

"Confirm.ConfrimToJoinChannel" = "Do you want to join the channel \"%@\"?";
"Confirm.ConfrimToJoinSupergroup" = "Do you want to join the group \"%@\"?";

"Confirm.ReturnToGroup" = "Are you sure you want to return the group?";
"Confirm.LeaveFromGroup" = "Are you sure you want to leave the group?";

"Confirm.Header.kPermissionInlineBotContact" = "Share Your Phone Number?";
"Confirm.Header.kPermissionInlineBotGeo" = "Share Your Location?";
"Confirm.Header.kPermissionInlineBotLocationRequest" = "Share Your Location?";

"Confirm.Desc.kPermissionInlineBotContact" = "The bot will know your phone number. This can be useful for integration with other services.";
"Confirm.Desc.kPermissionInlineBotGeo" = "This will send your current location to the bot.";
"Confirm.Desc.kPermissionInlineBotLocationRequest" = "This bot would you like to know your location each time you send it a request. This can be used to provide location-specific results.";


"LocationService.UndefinedError" = "An error occurred. Please try again later.";
"Alert.MoreInfo" = "More Info";
"PEER_FLOOD_MESSAGES" = "Sorry, you can only send messages to mutual contacts at the moment.";
"LocationService.WifiDisabledError" = "Please, enable Wi-Fi for location service.";
"Link.ConfirmOpenExternalLink" = "Open %@?";
"Message.Action.ShareInlineSwitch" = "Share bot content";
"Conversation.ShareInlineSwitchResult" = "Select a user or chat to share content via %@";
"Settings.HandleMediaKeys" = "Handle media keys for in-app player";

"Emoji.Recent" = "Recent";
"Emoji.People" = "People";
"Emoji.Nature" = "Nature";
"Emoji.Food" = "Food & Drinks";
"Emoji.TravelAndPlaces" = "Travel & Places";
"Emoji.Symbols" = "Symbols";
"EGS.Emoji" = "Emoji";
"EGS.GifsAndStickers" = "Stickers & GIFs";
"Stickers.Recent" = "Recent";
"Gifs.SavedGifs" = "Saved GIFs";
"TL_topPeerCategoryCorrespondents" = "People";
"TL_topPeerCategoryGroups" = "Groups";
"TL_topPeerCategoryBotsPM" = "Bots";
"Recent.Recent" = "Recent";
"Recent.More" = "Show More";
"Recent.Less" = "Show Less";
"EditHeaderMessage" = "Edit message";
"PasscodeSettings.TurnOffDescription" = "Note: if you forget your passcode, log out and in again to reset.";
"Settings.ESGLayoutSetting" = "Enable emoji sidebar";
"Message.Edited" = "edited";
"Settings.CheckMarkedInputText" = "Input optimizations for Chinese and Korean";
"EditMessage.EditErrorAlert" = "Sorry, you can't edit this message";
"Context.Select" = "Select message";
"Conversation.Draft" = "Draft: %@";